doc/s-sql-special-characters.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-12 Tue 18:44 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL Special Characters</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL Special Characters</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd969c02">S-SQL Examples Home Page</a></li>
<li><a href="#equal">:= The Equal operator</a></li>
<li><a href="#plus">:+ The Plus operator</a></li>
<li><a href="#not-equal">:&lt;&gt; The Not Equals or Greater or Lesser than operators</a></li>
<li><a href="#concate">:| Concatenating Columns</a></li>
<li><a href="#regex">:~, :!~, :~* Regex Match</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgd969c02" class="outline-2">
<h2 id="orgd969c02"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-orgd969c02">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>

<p>
You can generally assume that most Postgresql operators will act similarly to the following:
</p>
</div>
</div>
<div id="outline-container-equal" class="outline-2">
<h2 id="equal">:= The Equal operator</h2>
<div class="outline-text-2" id="text-equal">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'id 'name <span class="org-builtin">:from</span> 'regions <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'name <span class="org-string">"South America"</span>)))

((7 <span class="org-string">"South America"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-plus" class="outline-2">
<h2 id="plus">:+ The Plus operator</h2>
<div class="outline-text-2" id="text-plus">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:+</span> 'id 12) 'name
                <span class="org-builtin">:from</span> 'regions
                <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'name <span class="org-string">"South America"</span>)))
((19 <span class="org-string">"South America"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-not-equal" class="outline-2">
<h2 id="not-equal">:&lt;&gt; The Not Equals or Greater or Lesser than operators</h2>
<div class="outline-text-2" id="text-not-equal">
<p>
The not equals operator
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'id 'name
                <span class="org-builtin">:from</span> 'regions
                <span class="org-builtin">:where</span> (<span class="org-builtin">:&lt;&gt;</span> 'name <span class="org-string">"Africa"</span>)))

((3 <span class="org-string">"Central America"</span>) (5 <span class="org-string">"Middle East"</span>) (6 <span class="org-string">"North America"</span>) (7 <span class="org-string">"SouthAmerica"</span>) (8 <span class="org-string">"Central Asia"</span>) (9 <span class="org-string">"Pacific"</span>) (10 <span class="org-string">"Caribbean"</span>) (11 <span class="org-string">"Eastern Europe"</span>) (4 <span class="org-string">"Western Europe"</span>)  (2 <span class="org-string">"Asia"</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-concate" class="outline-2">
<h2 id="concate">:| Concatenating Columns</h2>
<div class="outline-text-2" id="text-concate">
<p>
The concatenation operator combines two or more columns into a single column return. First, consider the query on a raw sql string:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span class="org-string">"(SELECT countries.id, (countries.name | '-' | regions.name)</span>
<span class="org-string">         FROM countries, regions</span>
<span class="org-string">         WHERE ((regions.id = countries.region_id)</span>
<span class="org-string">               and (countries.name = 'US')))"</span>)

((21 <span class="org-string">"US-North America"</span>))

</pre>
</div>

<p>
Now consider the result using s-sql.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'countries.id (:| 'countries.name "-" 'regions.name)
                <span class="org-builtin">:from</span> 'countries 'regions
                <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'regions.id 'countries.region-id)
                             (<span class="org-builtin">:=</span> 'countries.name "US"))))

((21 "US-North America"))

</pre>
</div>
</div>
</div>

<div id="outline-container-regex" class="outline-2">
<h2 id="regex">:~, :!~, :~* Regex Match</h2>
<div class="outline-text-2" id="text-regex">
<p>
Regular expression matching operators. The exclamation mark means 'does not match',
the asterisk makes the match case-insensitive.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:regexp_match</span> <span class="org-string">"foobarbequebaz"</span> <span class="org-string">"bar.*que"</span>)) <span class="org-builtin">:single</span>)

#(<span class="org-string">"barbeque"</span>)

(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:regexp_match</span> <span class="org-string">"foobarbequebaz"</span> <span class="org-string">"bar.~que"</span>)) <span class="org-builtin">:single</span>)

<span class="org-builtin">:NULL</span>

(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:~</span> <span class="org-string">"foobarbequebaz"</span> <span class="org-string">"bar.*que"</span>) ) <span class="org-builtin">:single</span>)

t

(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:!~</span> <span class="org-string">"foobarbequebaz"</span> <span class="org-string">"bar.*que"</span>) ) <span class="org-builtin">:single</span>)

nil

(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:~</span> <span class="org-string">"foobarbequebaz"</span> <span class="org-string">"barque"</span>) ) <span class="org-builtin">:single</span>)

nil

(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:~</span> <span class="org-string">"foobarbequebaz"</span> <span class="org-string">"barbeque"</span>) ) <span class="org-builtin">:single</span>)

t

(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:~</span> <span class="org-string">"foobarBequebaz"</span> <span class="org-string">"barbeque"</span>) ) <span class="org-builtin">:single</span>)

nil

(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:~*</span> <span class="org-string">"foobarBequebaz"</span> <span class="org-string">"barbeque"</span>) ) <span class="org-builtin">:single</span>)

t

(query (<span class="org-builtin">:select</span> 'id 'text <span class="org-builtin">:from</span> 'text-search <span class="org-builtin">:where</span> (<span class="org-builtin">:~</span> 'text <span class="org-string">"sushi"</span>)))

</pre>
</div>
</div>
</div>
</div>
</body>
</html>